; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-6)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x0-y5
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x1-y5
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x2-y5
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x3-y5
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
	loc-x4-y5
	loc-x5-y0
	loc-x5-y1
	loc-x5-y2
	loc-x5-y3
	loc-x5-y4
	loc-x5-y5
- place

)
(:init
	(at-robot loc-x3-y3)
	(visited loc-x3-y3)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x0-y4 loc-x0-y5)
 	(connected loc-x0-y5 loc-x1-y5)
 	(connected loc-x0-y5 loc-x0-y4)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x1-y4 loc-x1-y5)
 	(connected loc-x1-y5 loc-x0-y5)
 	(connected loc-x1-y5 loc-x2-y5)
 	(connected loc-x1-y5 loc-x1-y4)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x2-y4 loc-x2-y5)
 	(connected loc-x2-y5 loc-x1-y5)
 	(connected loc-x2-y5 loc-x3-y5)
 	(connected loc-x2-y5 loc-x2-y4)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x3-y4 loc-x3-y5)
 	(connected loc-x3-y5 loc-x2-y5)
 	(connected loc-x3-y5 loc-x4-y5)
 	(connected loc-x3-y5 loc-x3-y4)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x5-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x5-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x5-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x5-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x5-y4)
 	(connected loc-x4-y4 loc-x4-y3)
 	(connected loc-x4-y4 loc-x4-y5)
 	(connected loc-x4-y5 loc-x3-y5)
 	(connected loc-x4-y5 loc-x5-y5)
 	(connected loc-x4-y5 loc-x4-y4)
 	(connected loc-x5-y0 loc-x4-y0)
 	(connected loc-x5-y0 loc-x5-y1)
 	(connected loc-x5-y1 loc-x4-y1)
 	(connected loc-x5-y1 loc-x5-y0)
 	(connected loc-x5-y1 loc-x5-y2)
 	(connected loc-x5-y2 loc-x4-y2)
 	(connected loc-x5-y2 loc-x5-y1)
 	(connected loc-x5-y2 loc-x5-y3)
 	(connected loc-x5-y3 loc-x4-y3)
 	(connected loc-x5-y3 loc-x5-y2)
 	(connected loc-x5-y3 loc-x5-y4)
 	(connected loc-x5-y4 loc-x4-y4)
 	(connected loc-x5-y4 loc-x5-y3)
 	(connected loc-x5-y4 loc-x5-y5)
 	(connected loc-x5-y5 loc-x4-y5)
 	(connected loc-x5-y5 loc-x5-y4)

)
(:goal
(and
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x0-y4)
	(visited loc-x0-y5)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y3)
	(visited loc-x1-y4)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x3-y0)
	(visited loc-x3-y3)
	(visited loc-x3-y4)
	(visited loc-x5-y0)
	(visited loc-x5-y4)
	(visited loc-x5-y5)
)
)
)

; plan
1. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 1 of 16
2. (visit loc-x3-y4)
   added: (visited loc-x3-y4)
   goals met: 2 of 16
3. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 2 of 16
4. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 2 of 16
5. (move loc-x1-y4 loc-x1-y3)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y3)
   goals met: 2 of 16
6. (visit loc-x1-y3)
   added: (visited loc-x1-y3)
   goals met: 3 of 16
7. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3)
   goals met: 3 of 16
8. (move loc-x0-y3 loc-x0-y2)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y2)
   goals met: 3 of 16
9. (visit loc-x0-y2)
   added: (visited loc-x0-y2)
   goals met: 4 of 16
10. (move loc-x0-y2 loc-x0-y3)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x0-y3)
   goals met: 4 of 16
11. (move loc-x0-y3 loc-x0-y4)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y4)
   goals met: 4 of 16
12. (visit loc-x0-y4)
   added: (visited loc-x0-y4)
   goals met: 5 of 16
13. (move loc-x0-y4 loc-x1-y4)
   deleted: (at-robot loc-x0-y4)
   added: (at-robot loc-x1-y4)
   goals met: 5 of 16
14. (visit loc-x1-y4)
   added: (visited loc-x1-y4)
   goals met: 6 of 16
15. (move loc-x1-y4 loc-x1-y3)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y3)
   goals met: 6 of 16
16. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3)
   goals met: 6 of 16
17. (visit loc-x0-y3)
   added: (visited loc-x0-y3)
   goals met: 7 of 16
18. (move loc-x0-y3 loc-x0-y2)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y2)
   goals met: 7 of 16
19. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 7 of 16
20. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 7 of 16
21. (visit loc-x1-y1)
   added: (visited loc-x1-y1)
   goals met: 8 of 16
22. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1)
   goals met: 8 of 16
23. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0)
   goals met: 8 of 16
24. (visit loc-x2-y0)
   added: (visited loc-x2-y0)
   goals met: 9 of 16
25. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0)
   goals met: 9 of 16
26. (move loc-x3-y0 loc-x4-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x4-y0)
   goals met: 9 of 16
27. (move loc-x4-y0 loc-x5-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x5-y0)
   goals met: 9 of 16
28. (visit loc-x5-y0)
   added: (visited loc-x5-y0)
   goals met: 10 of 16
29. (move loc-x5-y0 loc-x4-y0)
   deleted: (at-robot loc-x5-y0)
   added: (at-robot loc-x4-y0)
   goals met: 10 of 16
30. (move loc-x4-y0 loc-x3-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x3-y0)
   goals met: 10 of 16
31. (visit loc-x3-y0)
   added: (visited loc-x3-y0)
   goals met: 11 of 16
32. (move loc-x3-y0 loc-x3-y1)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x3-y1)
   goals met: 11 of 16
33. (move loc-x3-y1 loc-x3-y2)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y2)
   goals met: 11 of 16
34. (move loc-x3-y2 loc-x3-y3)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y3)
   goals met: 11 of 16
35. (move loc-x3-y3 loc-x2-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x2-y3)
   goals met: 11 of 16
36. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 11 of 16
37. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 11 of 16
38. (move loc-x1-y4 loc-x1-y5)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y5)
   goals met: 11 of 16
39. (move loc-x1-y5 loc-x2-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x2-y5)
   goals met: 11 of 16
40. (move loc-x2-y5 loc-x3-y5)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x3-y5)
   goals met: 11 of 16
41. (move loc-x3-y5 loc-x4-y5)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x4-y5)
   goals met: 11 of 16
42. (move loc-x4-y5 loc-x5-y5)
   deleted: (at-robot loc-x4-y5)
   added: (at-robot loc-x5-y5)
   goals met: 11 of 16
43. (visit loc-x5-y5)
   added: (visited loc-x5-y5)
   goals met: 12 of 16
44. (move loc-x5-y5 loc-x5-y4)
   deleted: (at-robot loc-x5-y5)
   added: (at-robot loc-x5-y4)
   goals met: 12 of 16
45. (visit loc-x5-y4)
   added: (visited loc-x5-y4)
   goals met: 13 of 16
46. (move loc-x5-y4 loc-x4-y4)
   deleted: (at-robot loc-x5-y4)
   added: (at-robot loc-x4-y4)
   goals met: 13 of 16
47. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 13 of 16
48. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 13 of 16
49. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 13 of 16
50. (move loc-x1-y4 loc-x1-y3)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y3)
   goals met: 13 of 16
51. (move loc-x1-y3 loc-x1-y2)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y2)
   goals met: 13 of 16
52. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 13 of 16
53. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 13 of 16
54. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 14 of 16
55. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 14 of 16
56. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1)
   goals met: 14 of 16
57. (visit loc-x2-y1)
   added: (visited loc-x2-y1)
   goals met: 15 of 16
58. (move loc-x2-y1 loc-x2-y2)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y2)
   goals met: 15 of 16
59. (move loc-x2-y2 loc-x2-y3)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y3)
   goals met: 15 of 16
60. (move loc-x2-y3 loc-x2-y4)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x2-y4)
   goals met: 15 of 16
61. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 15 of 16
62. (move loc-x1-y4 loc-x1-y5)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y5)
   goals met: 15 of 16
63. (move loc-x1-y5 loc-x0-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x0-y5)
   goals met: 15 of 16
64. (visit loc-x0-y5)
   added: (visited loc-x0-y5)
   goals met: 16 of 16
